#برنامه ي گرفت قد و وزن و دادن بي ام اي
import math
q = int ( input ( " قد خود را وارد نماييد " ))
v = int ( input ( " وزن خود را وارد نماييد " ))
i = q/100
m =i*i
b = v/m
c = math.floor (b)
print ( "     " , c )
if b <= 18 :
    print ( " شما کمبود وزن داريد "  )
    print ( " بي ام آي کمتر از 18 نشانه ي کمبود وزن است ")
    print ( " مقدار کمبود وزن شما " , c - 19 ,  " کيلو گرم "  )
elif b <= 25 :
    print ( " وزن شما نرمال است " )
    print ( " بي ام آي بين 18 تا 25 نرمال است ")
elif b < 30 :
    print ( " شما اضافه وزن داريد " )
    print ( " بي ام آي بين 25 تا 30 نشانه ي اضافه وزن است ")
    print ( " مقدار اضافه وزن شما " , c - 25 ,  " کيلو گرم "  )
else :
     print ( " شما چاق هستيد ")
     print ( " بي ام آي بيشتر از 30 نشانه ي چاقي است ")
    


